---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.Density
source: html/3c28a81e-5afe-c355-dc5a-0f55defcbfda.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.Density Property

The density of the material.

## Syntax (C#)
```csharp
public double Density { get; }
```